load-test/results/cache-hit-vs-miss.txt
(venv) PS C:\Users\Prema\Downloads\linkforge-week1\linkforge\load-test> python seed_links.py --count 500
Seeded 500 links for tenant eb61007f-81e1-4c09-84fb-265a4806397a.
Codes written to seeded_codes.json
(venv) PS C:\Users\Prema\Downloads\linkforge-week1\linkforge\load-test> k6 run -e MODE=miss -e BASE_URL=http://localhost:8000 -e VUS=20 -e DURATION=30s redirect_test.js
         /\      Grafana   /‾‾/
    /\  /  \     |\  __   /  /
   /  \/    \    | |/ /  /   ‾‾\
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/
     execution: local
        script: redirect_test.js
        output: -
     scenarios: (100.00%) 1 scenario, 20 max VUs, 1m0s max duration (incl. graceful stop):
              * default: 20 looping VUs for 30s (gracefulStop: 30s)
  █ TOTAL RESULTS
    checks_total.......: 15732   524.095551/s
    checks_succeeded...: 100.00% 15732 out of 15732
    checks_failed......: 0.00%   0 out of 15732
    ✓ status is 307
    HTTP
    http_req_duration..............: avg=37.65ms min=16.13ms med=30.07ms max=910.62ms p(90)=53.03ms p(95)=60.42ms
      { expected_response:true }...: avg=37.65ms min=16.13ms med=30.07ms max=910.62ms p(90)=53.03ms p(95)=60.42ms
    http_req_failed................: 0.00%  0 out of 15732
    http_reqs......................: 15732  524.095551/s
    EXECUTION
    iteration_duration.............: avg=38.1ms  min=16.37ms med=30.45ms max=945.37ms p(90)=53.42ms p(95)=60.73ms
    iterations.....................: 15732  524.095551/s
    vus............................: 20     min=20         max=20
    vus_max........................: 20     min=20         max=20
    NETWORK
    data_received..................: 2.2 MB 73 kB/s
    data_sent......................: 1.3 MB 42 kB/s
running (0m30.0s), 00/20 VUs, 15732 complete and 0 interrupted iterations
default ✓ [======================================] 20 VUs  30s
(venv) PS C:\Users\Prema\Downloads\linkforge-week1\linkforge\load-test> k6 run -e MODE=hit -e BASE_URL=http://localhost:8000 -e VUS=20 -e DURATION=30s redirect_test.js
         /\      Grafana   /‾‾/
    /\  /  \     |\  __   /  /
   /  \/    \    | |/ /  /   ‾‾\
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/
     execution: local
        script: redirect_test.js
        output: -
     scenarios: (100.00%) 1 scenario, 20 max VUs, 1m0s max duration (incl. graceful stop):
              * default: 20 looping VUs for 30s (gracefulStop: 30s)
  █ TOTAL RESULTS
    checks_total.......: 19363   645.066497/s
    checks_succeeded...: 100.00% 19363 out of 19363
    checks_failed......: 0.00%   0 out of 19363
    ✓ status is 307
    HTTP
    http_req_duration..............: avg=30.66ms min=14.65ms med=28.39ms max=165.16ms p(90)=43.89ms p(95)=48.82ms
      { expected_response:true }...: avg=30.66ms min=14.65ms med=28.39ms max=165.16ms p(90)=43.89ms p(95)=48.82ms
    http_req_failed................: 0.00%  0 out of 19363
    http_reqs......................: 19363  645.066497/s
    EXECUTION
    iteration_duration.............: avg=30.96ms min=14.65ms med=28.67ms max=165.23ms p(90)=44.34ms p(95)=49.15ms
    iterations.....................: 19363  645.066497/s
    vus............................: 20     min=20         max=20
    vus_max........................: 20     min=20         max=20
    NETWORK
    data_received..................: 2.7 MB 90 kB/s
    data_sent......................: 1.5 MB 52 kB/s
running (0m30.0s), 00/20 VUs, 19363 complete and 0 interrupted iterations
default ✓ [======================================] 20 VUs  30s